var smileys = [{ char: "😀" }, { char: "😁" }, { char: "😂" }, { char: "🤣" }, { char: "😃" }, { char: "😄" }, { char: "😅" }, { char: "😆" }, { char: "😉" }, { char: "😊" }, { char: "😋" }, { char: "😎" }, { char: "😍" }, { char: "😘" }, { char: "😗" }, { char: "😙" }, { char: "😚" }, { char: "😊" }, { char: "🙂" }, { char: "🤗" }, { char: "🤩" }, { char: "🤔" }, { char: "🤨" }, { char: "😐" }, { char: "😑" }, { char: "😶" }, { char: "🙄" }, { char: "😏" }, { char: "😣" }, { char: "😥" }, { char: "😮" }, { char: "🤐" }, { char: "😯" }, { char: "😪" }, { char: "😫" }, { char: "😴" }, { char: "😌" }, { char: "😛" }, { char: "😜" }, { char: "😝" }, { char: "🤤" }, { char: "😒" }, { char: "😓" }, { char: "😔" }, { char: "😕" }, { char: "🙃" }, { char: "🤑" }, { char: "😲" }, { char: "☹️" }, { char: "🙁" }, { char: "😖" }, { char: "😞" }, { char: "😟" }, { char: "😤" }, { char: "😢" }, { char: "😭" }, { char: "😦" }, { char: "😧" }, { char: "😨" }, { char: "😩" }, { char: "🤯" }, { char: "😬" }, { char: "😰" }, { char: "😱" }, { char: "😳" }, { char: "🤪" }, { char: "😵" }, { char: "😡" }, { char: "😠" }, { char: "🤬" }, { char: "😷" }, { char: "🤒" }, { char: "🤕" }, { char: "🤢" }, { char: "🤮" }, { char: "🤧" }, { char: "😇" }, { char: "🤠" }, { char: "🤡" }, { char: "🤥" }, { char: "🤫" }, { char: "🤭" }, { char: "🧐" }, { char: "🤓" }, { char: "😈" }, { char: "👿" }, { char: "👹" }, { char: "👺" }, { char: "💀" }, { char: "☠️" }, { char: "👻" }, { char: "👽" }, { char: "👾" }, { char: "🤖" }, { char: "💩" }, { char: "😺" }, { char: "😸" }, { char: "😹" }, { char: "😻" }, { char: "😼" }, { char: "😽" }, { char: "🙀" }, { char: "😿" }, { char: "😾" }, { char: "🙈" }, { char: "🙉" }, { char: "🙊" }, { char: "👶" }, { char: "👶🏻" }, { char: "👶🏼" }, { char: "👶🏽" }, { char: "👶🏾" }, { char: "👶🏿" }, { char: "🧒" }, { char: "🧒🏻" }, { char: "🧒🏼" }, { char: "🧒🏽" }, { char: "🧒🏾" }, { char: "🧒🏿" }, { char: "👦" }, { char: "👦🏻" }, { char: "👦🏼" }, { char: "👦🏽" }, { char: "👦🏾" }, { char: "👦🏿" }, { char: "👧" }, { char: "👧🏻" }, { char: "👧🏼" }, { char: "👧🏽" }, { char: "👧🏾" }, { char: "👧🏿" }, { char: "🧑" }, { char: "🧑🏻" }, { char: "🧑🏼" }, { char: "🧑🏽" }, { char: "🧑🏾" }, { char: "🧑🏿" }, { char: "👨" }, { char: "👨🏻" }, { char: "👨🏼" }, { char: "👨🏽" }, { char: "👨🏾" }, { char: "👨🏿" }, { char: "👩" }, { char: "👩🏻" }, { char: "👩🏼" }, { char: "👩🏽" }, { char: "👩🏾" }, { char: "👩🏿" }, { char: "🧓" }, { char: "🧓🏻" }, { char: "🧓🏼" }, { char: "🧓🏽" }, { char: "🧓🏾" }, { char: "🧓🏿" }, { char: "👴" }, { char: "👴🏻" }, { char: "👴🏼" }, { char: "👴🏽" }, { char: "👴🏾" }, { char: "👴🏿" }, { char: "👵" }, { char: "👵🏻" }, { char: "👵🏼" }, { char: "👵🏽" }, { char: "👵🏾" }, { char: "👵🏿" }, { char: "👨‍⚕️" }, { char: "👨🏻‍⚕️" }, { char: "👨🏼‍⚕️" }, { char: "👨🏽‍⚕️" }, { char: "👨🏾‍⚕️" }, { char: "👨🏿‍⚕️" }, { char: "👩‍⚕️" }, { char: "👩🏻‍⚕️" }, { char: "👩🏼‍⚕️" }, { char: "👩🏽‍⚕️" }, { char: "👩🏾‍⚕️" }, { char: "👩🏿‍⚕️" }, { char: "👨‍🎓" }, { char: "👨🏻‍🎓" }, { char: "👨🏼‍🎓" }, { char: "👨🏽‍🎓" }, { char: "👨🏾‍🎓" }, { char: "👨🏿‍🎓" }, { char: "👩‍🎓" }, { char: "👩🏻‍🎓" }, { char: "👩🏼‍🎓" }, { char: "👩🏽‍🎓" }, { char: "👩🏾‍🎓" }, { char: "👩🏿‍🎓" }, { char: "👨‍🏫" }, { char: "👨🏻‍🏫" }, { char: "👨🏼‍🏫" }, { char: "👨🏽‍🏫" }, { char: "👨🏾‍🏫" }, { char: "👨🏿‍🏫" }, { char: "👩‍🏫" }, { char: "👩🏻‍🏫" }, { char: "👩🏼‍🏫" }, { char: "👩🏽‍🏫" }, { char: "👩🏾‍🏫" }, { char: "👩🏿‍🏫" }, { char: "👨‍⚖️" }, { char: "👨🏻‍⚖️" }, { char: "👨🏼‍⚖️" }, { char: "👨🏽‍⚖️" }, { char: "👨🏾‍⚖️" }, { char: "👨🏿‍⚖️" }, { char: "👩‍⚖️" }, { char: "👩🏻‍⚖️" }, { char: "👩🏼‍⚖️" }, { char: "👩🏽‍⚖️" }, { char: "👩🏾‍⚖️" }, { char: "👩🏿‍⚖️" }, { char: "👨‍🌾" }, { char: "👨🏻‍🌾" }, { char: "👨🏼‍🌾" }, { char: "👨🏽‍🌾" }, { char: "👨🏾‍🌾" }, { char: "👨🏿‍🌾" }, { char: "👩‍🌾" }, { char: "👩🏻‍🌾" }, { char: "👩🏼‍🌾" }, { char: "👩🏽‍🌾" }, { char: "👩🏾‍🌾" }, { char: "👩🏿‍🌾" }, { char: "👨‍🍳" }, { char: "👨🏻‍🍳" }, { char: "👨🏼‍🍳" }, { char: "👨🏽‍🍳" }, { char: "👨🏾‍🍳" }, { char: "👨🏿‍🍳" }, { char: "👩‍🍳" }, { char: "👩🏻‍🍳" }, { char: "👩🏼‍🍳" }, { char: "👩🏽‍🍳" }, { char: "👩🏾‍🍳" }, { char: "👩🏿‍🍳" }, { char: "👨‍🔧" }, { char: "👨🏻‍🔧" }, 
               { char: "👨🏼‍🔧" }, { char: "👨🏽‍🔧" }, { char: "👨🏾‍🔧" }, { char: "👨🏿‍🔧" }, { char: "👩‍🔧" }, { char: "👩🏻‍🔧" }, { char: "👩🏼‍🔧" }, { char: "👩🏽‍🔧" }, { char: "👩🏾‍🔧" }, { char: "👩🏿‍🔧" }, { char: "👨‍🏭" }, { char: "👨🏻‍🏭" }, { char: "👨🏼‍🏭" }, { char: "👨🏽‍🏭" }, { char: "👨🏾‍🏭" }, { char: "👨🏿‍🏭" }, { char: "👩‍🏭" }, { char: "👩🏻‍🏭" }, { char: "👩🏼‍🏭" }, { char: "👩🏽‍🏭" }, { char: "👩🏾‍🏭" }, { char: "👩🏿‍🏭" }, { char: "👨‍💼" }, { char: "👨🏻‍💼" }, { char: "👨🏼‍💼" }, { char: "👨🏽‍💼" }, { char: "👨🏾‍💼" }, { char: "👨🏿‍💼" }, { char: "👩‍💼" }, { char: "👩🏻‍💼" }, { char: "👩🏼‍💼" }, { char: "👩🏽‍💼" }, { char: "👩🏾‍💼" }, { char: "👩🏿‍💼" }, { char: "👨‍🔬" }, { char: "👨🏻‍🔬" }, { char: "👨🏼‍🔬" }, { char: "👨🏽‍🔬" }, { char: "👨🏾‍🔬" }, { char: "👨🏿‍🔬" }, { char: "👩‍🔬" }, { char: "👩🏻‍🔬" }, { char: "👩🏼‍🔬" }, { char: "👩🏽‍🔬" }, { char: "👩🏾‍🔬" }, { char: "👩🏿‍🔬" }, { char: "👨‍💻" }, { char: "👨🏻‍💻" }, { char: "👨🏼‍💻" }, { char: "👨🏽‍💻" }, { char: "👨🏾‍💻" }, { char: "👨🏿‍💻" }, { char: "👩‍💻" }, { char: "👩🏻‍💻" }, { char: "👩🏼‍💻" }, { char: "👩🏽‍💻" }, { char: "👩🏾‍💻" }, { char: "👩🏿‍💻" }, { char: "👨‍🎤" }, { char: "👨🏻‍🎤" }, { char: "👨🏼‍🎤" }, { char: "👨🏽‍🎤" }, { char: "👨🏾‍🎤" }, { char: "👨🏿‍🎤" }, { char: "👩‍🎤" }, { char: "👩🏻‍🎤" }, { char: "👩🏼‍🎤" }, { char: "👩🏽‍🎤" }, { char: "👩🏾‍🎤" }, { char: "👩🏿‍🎤" }, { char: "👨‍🎨" }, { char: "👨🏻‍🎨" }, { char: "👨🏼‍🎨" }, { char: "👨🏽‍🎨" }, { char: "👨🏾‍🎨" }, { char: "👨🏿‍🎨" }, { char: "👩‍🎨" }, { char: "👩🏻‍🎨" }, { char: "👩🏼‍🎨" }, { char: "👩🏽‍🎨" }, { char: "👩🏾‍🎨" }, { char: "👩🏿‍🎨" }, { char: "👨‍✈️" }, { char: "👨🏻‍✈️" }, { char: "👨🏼‍✈️" }, { char: "👨🏽‍✈️" }, { char: "👨🏾‍✈️" }, { char: "👨🏿‍✈️" }, { char: "👩‍✈️" }, { char: "👩🏻‍✈️" }, { char: "👩🏼‍✈️" }, { char: "👩🏽‍✈️" }, { char: "👩🏾‍✈️" }, { char: "👩🏿‍✈️" }, { char: "👨‍🚀" }, { char: "👨🏻‍🚀" }, { char: "👨🏼‍🚀" }, { char: "👨🏽‍🚀" }, { char: "👨🏾‍🚀" }, { char: "👨🏿‍🚀" }, { char: "👩‍🚀" }, { char: "👩🏻‍🚀" }, { char: "👩🏼‍🚀" }, { char: "👩🏽‍🚀" }, { char: "👩🏾‍🚀" }, { char: "👩🏿‍🚀" }, { char: "👨‍🚒" }, { char: "👨🏻‍🚒" }, { char: "👨🏼‍🚒" }, { char: "👨🏽‍🚒" }, { char: "👨🏾‍🚒" }, { char: "👨🏿‍🚒" }, { char: "👩‍🚒" }, { char: "👩🏻‍🚒" }, { char: "👩🏼‍🚒" }, { char: "👩🏽‍🚒" }, { char: "👩🏾‍🚒" }, { char: "👩🏿‍🚒" }, { char: "👮" }, { char: "👮🏻" }, { char: "👮🏼" }, { char: "👮🏽" }, { char: "👮🏾" }, { char: "👮🏿" }, { char: "👮‍♂️" }, { char: "👮🏻‍♂️" }, { char: "👮🏼‍♂️" }, { char: "👮🏽‍♂️" }, { char: "👮🏾‍♂️" }, { char: "👮🏿‍♂️" }, { char: "👮‍♀️" }, { char: "👮🏻‍♀️" }, { char: "👮🏼‍♀️" }, { char: "👮🏽‍♀️" }, { char: "👮🏾‍♀️" }, { char: "👮🏿‍♀️" }, { char: "🕵" }, { char: "🕵🏻" }, { char: "🕵🏼" }, { char: "🕵🏽" }, { char: "🕵🏾" }, { char: "🕵🏿" }, { char: "🕵️‍♂️" }, { char: "🕵🏻‍♂️" }, { char: "🕵🏼‍♂️" }, { char: "🕵🏽‍♂️" }, { char: "🕵🏾‍♂️" }, { char: "🕵🏿‍♂️" }, { char: "🕵️‍♀️" }, { char: "🕵🏻‍♀️" }, { char: "🕵🏼‍♀️" }, { char: "🕵🏽‍♀️" }, { char: "🕵🏾‍♀️" }, { char: "🕵🏿‍♀️" }, { char: "💂" }, { char: "💂🏻" }, { char: "💂🏼" }, { char: "💂🏽" }, { char: "💂🏾" }, { char: "💂🏿" }, { char: "💂‍♂️" }, { char: "💂🏻‍♂️" }, { char: "💂🏼‍♂️" }, { char: "💂🏽‍♂️" }, { char: "💂🏾‍♂️" }, { char: "💂🏿‍♂️" }, { char: "💂‍♀️" }, { char: "💂🏻‍♀️" }, { char: "💂🏼‍♀️" }, { char: "💂🏽‍♀️" }, { char: "💂🏾‍♀️" }, { char: "💂🏿‍♀️" }, { char: "👷" }, { char: "👷🏻" }, { char: "👷🏼" }, { char: "👷🏽" }, { char: "👷🏾" }, { char: "👷🏿" }, { char: "👷‍♂️" }, { char: "👷🏻‍♂️" }, { char: "👷🏼‍♂️" }, { char: "👷🏽‍♂️" }, { char: "👷🏾‍♂️" }, { char: "👷🏿‍♂️" }, { char: "👷‍♀️" }, { char: "👷🏻‍♀️" }, { char: "👷🏼‍♀️" }, { char: "👷🏽‍♀️" }, { char: "👷🏾‍♀️" }, { char: "👷🏿‍♀️" }, { char: "🤴" }, { char: "🤴🏻" }, { char: "🤴🏼" }, { char: "🤴🏽" }, { char: "🤴🏾" }, { char: "🤴🏿" }, { char: "👸" }, { char: "👸🏻" }, { char: "👸🏼" }, { char: "👸🏽" }, { char: "👸🏾" }, { char: "👸🏿" }, { char: "👳" }, { char: "👳🏻" }, { char: "👳🏼" }, { char: "👳🏽" }, { char: "👳🏾" }, { char: "👳🏿" }, { char: "👳‍♂️" }, { char: "👳🏻‍♂️" }, { char: "👳🏼‍♂️" }, { char: "👳🏽‍♂️" }, { char: "👳🏾‍♂️" }, { char: "👳🏿‍♂️" }, { char: "👳‍♀️" }, { char: "👳🏻‍♀️" }, { char: "👳🏼‍♀️" }, { char: "👳🏽‍♀️" }, { char: "👳🏾‍♀️" }, { char: "👳🏿‍♀️" }, { char: "👲" }, { char: "👲🏻" }, { char: "👲🏼" }, { char: "👲🏽" }, { char: "👲🏾" }, 
               { char: "👲🏿" }, { char: "🧕" }, { char: "🧕🏻" }, { char: "🧕🏼" }, { char: "🧕🏽" }, { char: "🧕🏾" }, { char: "🧕🏿" }, { char: "🧔" }, { char: "🧔🏻" }, { char: "🧔🏼" }, { char: "🧔🏽" }, { char: "🧔🏾" }, { char: "🧔🏿" }, { char: "👱" }, { char: "👱🏻" }, { char: "👱🏼" }, { char: "👱🏽" }, { char: "👱🏾" }, { char: "👱🏿" }, { char: "👱‍♂️" }, { char: "👱🏻‍♂️" }, { char: "👱🏼‍♂️" }, { char: "👱🏽‍♂️" }, { char: "👱🏾‍♂️" }, { char: "👱🏿‍♂️" }, { char: "👱‍♀️" }, { char: "👱🏻‍♀️" }, { char: "👱🏼‍♀️" }, { char: "👱🏽‍♀️" }, { char: "👱🏾‍♀️" }, { char: "👱🏿‍♀️" }, { char: "🤵" }, { char: "🤵🏻" }, { char: "🤵🏼" }, { char: "🤵🏽" }, { char: "🤵🏾" }, { char: "🤵🏿" }, { char: "👰" }, { char: "👰🏻" }, { char: "👰🏼" }, { char: "👰🏽" }, { char: "👰🏾" }, { char: "👰🏿" }, { char: "🤰" }, { char: "🤰🏻" }, { char: "🤰🏼" }, { char: "🤰🏽" }, { char: "🤰🏾" }, { char: "🤰🏿" }, { char: "🤱" }, { char: "🤱🏻" }, { char: "🤱🏼" }, { char: "🤱🏽" }, { char: "🤱🏾" }, { char: "🤱🏿" }, { char: "👼" }, { char: "👼🏻" }, { char: "👼🏼" }, { char: "👼🏽" }, { char: "👼🏾" }, { char: "👼🏿" }, { char: "🎅" }, { char: "🎅🏻" }, { char: "🎅🏼" }, { char: "🎅🏽" }, { char: "🎅🏾" }, { char: "🎅🏿" }, { char: "🤶" }, { char: "🤶🏻" }, { char: "🤶🏼" }, { char: "🤶🏽" }, { char: "🤶🏾" }, { char: "🤶🏿" }, { char: "🧙" }, { char: "🧙🏻" }, { char: "🧙🏼" }, { char: "🧙🏽" }, { char: "🧙🏾" }, { char: "🧙🏿" }, { char: "🧙‍♀️" }, { char: "🧙🏻‍♀️" }, { char: "🧙🏼‍♀️" }, { char: "🧙🏽‍♀️" }, { char: "🧙🏾‍♀️" }, { char: "🧙🏿‍♀️" }, { char: "🧙‍♂️" }, { char: "🧙🏻‍♂️" }, { char: "🧙🏼‍♂️" }, { char: "🧙🏽‍♂️" }, { char: "🧙🏾‍♂️" }, { char: "🧙🏿‍♂️" }, { char: "🧚" }, { char: "🧚🏻" }, { char: "🧚🏼" }, { char: "🧚🏽" }, { char: "🧚🏾" }, { char: "🧚🏿" }, { char: "🧚‍♀️" }, { char: "🧚🏻‍♀️" }, { char: "🧚🏼‍♀️" }, { char: "🧚🏽‍♀️" }, { char: "🧚🏾‍♀️" }, { char: "🧚🏿‍♀️" }, { char: "🧚‍♂️" }, { char: "🧚🏻‍♂️" }, { char: "🧚🏼‍♂️" }, { char: "🧚🏽‍♂️" }, { char: "🧚🏾‍♂️" }, { char: "🧚🏿‍♂️" }, { char: "🧛" }, { char: "🧛🏻" }, { char: "🧛🏼" }, { char: "🧛🏽" }, { char: "🧛🏾" }, { char: "🧛🏿" }, { char: "🧛‍♀️" }, { char: "🧛🏻‍♀️" }, { char: "🧛🏼‍♀️" }, { char: "🧛🏽‍♀️" }, { char: "🧛🏾‍♀️" }, { char: "🧛🏿‍♀️" }, { char: "🧛‍♂️" }, { char: "🧛🏻‍♂️" }, { char: "🧛🏼‍♂️" }, { char: "🧛🏽‍♂️" }, { char: "🧛🏾‍♂️" }, { char: "🧛🏿‍♂️" }, { char: "🧜" }, { char: "🧜🏻" }, { char: "🧜🏼" }, { char: "🧜🏽" }, { char: "🧜🏾" }, { char: "🧜🏿" }, { char: "🧜‍♀️" }, { char: "🧜🏻‍♀️" }, { char: "🧜🏼‍♀️" }, { char: "🧜🏽‍♀️" }, { char: "🧜🏾‍♀️" }, { char: "🧜🏿‍♀️" }, { char: "🧜‍♂️" }, { char: "🧜🏻‍♂️" }, { char: "🧜🏼‍♂️" }, { char: "🧜🏽‍♂️" }, { char: "🧜🏾‍♂️" }, { char: "🧜🏿‍♂️" }, { char: "🧝" }, { char: "🧝🏻" }, { char: "🧝🏼" }, { char: "🧝🏽" }, { char: "🧝🏾" }, { char: "🧝🏿" }, { char: "🧝‍♀️" }, { char: "🧝🏻‍♀️" }, { char: "🧝🏼‍♀️" }, { char: "🧝🏽‍♀️" }, { char: "🧝🏾‍♀️" }, { char: "🧝🏿‍♀️" }, { char: "🧝‍♂️" }, { char: "🧝🏻‍♂️" }, { char: "🧝🏼‍♂️" }, { char: "🧝🏽‍♂️" }, { char: "🧝🏾‍♂️" }, { char: "🧝🏿‍♂️" }, { char: "🧞" }, { char: "🧞‍♀️" }, { char: "🧞‍♂️" }, { char: "🧟" }, { char: "🧟‍♀️" }, { char: "🧟‍♂️" }, { char: "🙍" }, { char: "🙍🏻" }, { char: "🙍🏼" }, { char: "🙍🏽" }, { char: "🙍🏾" }, { char: "🙍🏿" }, { char: "🙍‍♂️" }, { char: "🙍🏻‍♂️" }, { char: "🙍🏼‍♂️" }, { char: "🙍🏽‍♂️" }, { char: "🙍🏾‍♂️" }, { char: "🙍🏿‍♂️" }, { char: "🙍‍♀️" }, { char: "🙍🏻‍♀️" }, { char: "🙍🏼‍♀️" }, { char: "🙍🏽‍♀️" }, { char: "🙍🏾‍♀️" }, { char: "🙍🏿‍♀️" }, { char: "🙎" }, { char: "🙎🏻" }, { char: "🙎🏼" }, { char: "🙎🏽" }, { char: "🙎🏾" }, { char: "🙎🏿" }, { char: "🙎‍♂️" }, { char: "🙎🏻‍♂️" }, { char: "🙎🏼‍♂️" }, { char: "🙎🏽‍♂️" }, { char: "🙎🏾‍♂️" }, { char: "🙎🏿‍♂️" }, { char: "🙎‍♀️" }, { char: "🙎🏻‍♀️" }, { char: "🙎🏼‍♀️" }, { char: "🙎🏽‍♀️" }, { char: "🙎🏾‍♀️" }, { char: "🙎🏿‍♀️" }, { char: "🙅" }, { char: "🙅🏻" }, { char: "🙅🏼" }, { char: "🙅🏽" }, { char: "🙅🏾" }, { char: "🙅🏿" }, { char: "🙅‍♂️" }, { char: "🙅🏻‍♂️" }, { char: "🙅🏼‍♂️" }, { char: "🙅🏽‍♂️" }, { char: "🙅🏾‍♂️" }, { char: "🙅🏿‍♂️" }, { char: "🙅‍♀️" }, { char: "🙅🏻‍♀️" }, { char: "🙅🏼‍♀️" }, { char: "🙅🏽‍♀️" }, { char: "🙅🏾‍♀️" }, { char: "🙅🏿‍♀️" }, { char: "🙆" }, { char: "🙆🏻" }, { char: "🙆🏼" }, { char: "🙆🏽" }, { char: "🙆🏾" }, { char: "🙆🏿" }, { char: "🙆‍♂️" }, { char: "🙆🏻‍♂️" }, { char: "🙆🏼‍♂️" }, { char: "🙆🏽‍♂️" }, { char: "🙆🏾‍♂️" }, { char: "🙆🏿‍♂️" }, { char: "🙆‍♀️" }, { char: "🙆🏻‍♀️" }, { char: "🙆🏼‍♀️" }, { char: "🙆🏽‍♀️" }, { char: "🙆🏾‍♀️" }, { char: "🙆🏿‍♀️" }, { char: "💁" }, { char: "💁🏻" }, { char: "💁🏼" }, { char: "💁🏽" }, 
               { char: "💁🏾" }, { char: "💁🏿" }, { char: "💁‍♂️" }, { char: "💁🏻‍♂️" }, { char: "💁🏼‍♂️" }, { char: "💁🏽‍♂️" }, { char: "💁🏾‍♂️" }, { char: "💁🏿‍♂️" }, { char: "💁‍♀️" }, { char: "💁🏻‍♀️" }, { char: "💁🏼‍♀️" }, { char: "💁🏽‍♀️" }, { char: "💁🏾‍♀️" }, { char: "💁🏿‍♀️" }, { char: "🙋" }, { char: "🙋🏻" }, { char: "🙋🏼" }, { char: "🙋🏽" }, { char: "🙋🏾" }, { char: "🙋🏿" }, { char: "🙋‍♂️" }, { char: "🙋🏻‍♂️" }, { char: "🙋🏼‍♂️" }, { char: "🙋🏽‍♂️" }, { char: "🙋🏾‍♂️" }, { char: "🙋🏿‍♂️" }, { char: "🙋‍♀️" }, { char: "🙋🏻‍♀️" }, { char: "🙋🏼‍♀️" }, { char: "🙋🏽‍♀️" }, { char: "🙋🏾‍♀️" }, { char: "🙋🏿‍♀️" }, { char: "🙇" }, { char: "🙇🏻" }, { char: "🙇🏼" }, { char: "🙇🏽" }, { char: "🙇🏾" }, { char: "🙇🏿" }, { char: "🙇‍♂️" }, { char: "🙇🏻‍♂️" }, { char: "🙇🏼‍♂️" }, { char: "🙇🏽‍♂️" }, { char: "🙇🏾‍♂️" }, { char: "🙇🏿‍♂️" }, { char: "🙇‍♀️" }, { char: "🙇🏻‍♀️" }, { char: "🙇🏼‍♀️" }, { char: "🙇🏽‍♀️" }, { char: "🙇🏾‍♀️" }, { char: "🙇🏿‍♀️" }, { char: "🤦" }, { char: "🤦🏻" }, { char: "🤦🏼" }, { char: "🤦🏽" }, { char: "🤦🏾" }, { char: "🤦🏿" }, { char: "🤦‍♂️" }, { char: "🤦🏻‍♂️" }, { char: "🤦🏼‍♂️" }, { char: "🤦🏽‍♂️" }, { char: "🤦🏾‍♂️" }, { char: "🤦🏿‍♂️" }, { char: "🤦‍♀️" }, { char: "🤦🏻‍♀️" }, { char: "🤦🏼‍♀️" }, { char: "🤦🏽‍♀️" }, { char: "🤦🏾‍♀️" }, { char: "🤦🏿‍♀️" }, { char: "🤷" }, { char: "🤷🏻" }, { char: "🤷🏼" }, { char: "🤷🏽" }, { char: "🤷🏾" }, { char: "🤷🏿" }, { char: "🤷‍♂️" }, { char: "🤷🏻‍♂️" }, { char: "🤷🏼‍♂️" }, { char: "🤷🏽‍♂️" }, { char: "🤷🏾‍♂️" }, { char: "🤷🏿‍♂️" }, { char: "🤷‍♀️" }, { char: "🤷🏻‍♀️" }, { char: "🤷🏼‍♀️" }, { char: "🤷🏽‍♀️" }, { char: "🤷🏾‍♀️" }, { char: "🤷🏿‍♀️" }, { char: "💆" }, { char: "💆🏻" }, { char: "💆🏼" }, { char: "💆🏽" }, { char: "💆🏾" }, { char: "💆🏿" }, { char: "💆‍♂️" }, { char: "💆🏻‍♂️" }, { char: "💆🏼‍♂️" }, { char: "💆🏽‍♂️" }, { char: "💆🏾‍♂️" }, { char: "💆🏿‍♂️" }, { char: "💆‍♀️" }, { char: "💆🏻‍♀️" }, { char: "💆🏼‍♀️" }, { char: "💆🏽‍♀️" }, { char: "💆🏾‍♀️" }, { char: "💆🏿‍♀️" }, { char: "💇" }, { char: "💇🏻" }, { char: "💇🏼" }, { char: "💇🏽" }, { char: "💇🏾" }, { char: "💇🏿" }, { char: "💇‍♂️" }, { char: "💇🏻‍♂️" }, { char: "💇🏼‍♂️" }, { char: "💇🏽‍♂️" }, { char: "💇🏾‍♂️" }, { char: "💇🏿‍♂️" }, { char: "💇‍♀️" }, { char: "💇🏻‍♀️" }, { char: "💇🏼‍♀️" }, { char: "💇🏽‍♀️" }, { char: "💇🏾‍♀️" }, { char: "💇🏿‍♀️" }, { char: "🚶" }, { char: "🚶🏻" }, { char: "🚶🏼" }, { char: "🚶🏽" }, { char: "🚶🏾" }, { char: "🚶🏿" }, { char: "🚶‍♂️" }, { char: "🚶🏻‍♂️" }, { char: "🚶🏼‍♂️" }, { char: "🚶🏽‍♂️" }, { char: "🚶🏾‍♂️" }, { char: "🚶🏿‍♂️" }, { char: "🚶‍♀️" }, { char: "🚶🏻‍♀️" }, { char: "🚶🏼‍♀️" }, { char: "🚶🏽‍♀️" }, { char: "🚶🏾‍♀️" }, { char: "🚶🏿‍♀️" }, { char: "🏃" }, { char: "🏃🏻" }, { char: "🏃🏼" }, { char: "🏃🏽" }, { char: "🏃🏾" }, { char: "🏃🏿" }, { char: "🏃‍♂️" }, { char: "🏃🏻‍♂️" }, { char: "🏃🏼‍♂️" }, { char: "🏃🏽‍♂️" }, { char: "🏃🏾‍♂️" }, { char: "🏃🏿‍♂️" }, { char: "🏃‍♀️" }, { char: "🏃🏻‍♀️" }, { char: "🏃🏼‍♀️" }, { char: "🏃🏽‍♀️" }, { char: "🏃🏾‍♀️" }, { char: "🏃🏿‍♀️" }, { char: "💃" }, { char: "💃🏻" }, { char: "💃🏼" }, { char: "💃🏽" }, { char: "💃🏾" }, { char: "💃🏿" }, { char: "🕺" }, { char: "🕺🏻" }, { char: "🕺🏼" }, { char: "🕺🏽" }, { char: "🕺🏾" }, { char: "🕺🏿" }, { char: "👯" }, { char: "👯‍♂️" }, { char: "👯‍♀️" }, { char: "🧖" }, { char: "🧖🏻" }, { char: "🧖🏼" }, { char: "🧖🏽" }, { char: "🧖🏾" }, { char: "🧖🏿" }, { char: "🧖‍♀️" }, { char: "🧖🏻‍♀️" }, { char: "🧖🏼‍♀️" }, { char: "🧖🏽‍♀️" }, { char: "🧖🏾‍♀️" }, { char: "🧖🏿‍♀️" }, { char: "🧖‍♂️" }, { char: "🧖🏻‍♂️" }, { char: "🧖🏼‍♂️" }, { char: "🧖🏽‍♂️" }, { char: "🧖🏾‍♂️" }, { char: "🧖🏿‍♂️" }, { char: "🧗" }, { char: "🧗🏻" }, { char: "🧗🏼" }, { char: "🧗🏽" }, { char: "🧗🏾" }, { char: "🧗🏿" }, { char: "🧗‍♀️" }, { char: "🧗🏻‍♀️" }, { char: "🧗🏼‍♀️" }, { char: "🧗🏽‍♀️" }, { char: "🧗🏾‍♀️" }, { char: "🧗🏿‍♀️" }, { char: "🧗‍♂️" }, { char: "🧗🏻‍♂️" }, { char: "🧗🏼‍♂️" }, { char: "🧗🏽‍♂️" }, { char: "🧗🏾‍♂️" }, { char: "🧗🏿‍♂️" }, { char: "🧘" }, { char: "🧘🏻" }, { char: "🧘🏼" }, { char: "🧘🏽" }, { char: "🧘🏾" }, { char: "🧘🏿" }, { char: "🧘‍♀️" }, { char: "🧘🏻‍♀️" }, { char: "🧘🏼‍♀️" }, { char: "🧘🏽‍♀️" }, { char: "🧘🏾‍♀️" }, { char: "🧘🏿‍♀️" }, { char: "🧘‍♂️" }, { char: "🧘🏻‍♂️" }, { char: "🧘🏼‍♂️" }, { char: "🧘🏽‍♂️" }, { char: "🧘🏾‍♂️" }, { char: "🧘🏿‍♂️" }, { char: "🛀" }, { char: "🛀🏻" }, { char: "🛀🏼" }, { char: "🛀🏽" }, { char: "🛀🏾" }, { char: "🛀🏿" }, { char: "🛌" }, { char: "🛌🏻" }, { char: "🛌🏼" }, { char: "🛌🏽" }, { char: "🛌🏾" }, { char: "🛌🏿" }, { char: "🕴" }, { char: "🕴🏻" }, { char: "🕴🏼" }, 
               { char: "🕴🏽" }, { char: "🕴🏾" }, { char: "🕴🏿" }, { char: "🗣️" }, { char: "👤" }, { char: "👥" }, { char: "🤺" }, { char: "🏇" }, { char: "🏇🏻" }, { char: "🏇🏼" }, { char: "🏇🏽" }, { char: "🏇🏾" }, { char: "🏇🏿" }, { char: "⛷" }, { char: "🏂" }, { char: "🏂🏻" }, { char: "🏂🏼" }, { char: "🏂🏽" }, { char: "🏂🏾" }, { char: "🏂🏿" }, { char: "🏌" }, { char: "🏌🏻" }, { char: "🏌🏼" }, { char: "🏌🏽" }, { char: "🏌🏾" }, { char: "🏌🏿" }, { char: "🏌️‍♂️" }, { char: "🏌🏻‍♂️" }, { char: "🏌🏼‍♂️" }, { char: "🏌🏽‍♂️" }, { char: "🏌🏾‍♂️" }, { char: "🏌🏿‍♂️" }, { char: "🏌️‍♀️" }, { char: "🏌🏻‍♀️" }, { char: "🏌🏼‍♀️" }, { char: "🏌🏽‍♀️" }, { char: "🏌🏾‍♀️" }, { char: "🏌🏿‍♀️" }, { char: "🏄" }, { char: "🏄🏻" }, { char: "🏄🏼" }, { char: "🏄🏽" }, { char: "🏄🏾" }, { char: "🏄🏿" }, { char: "🏄‍♂️" }, { char: "🏄🏻‍♂️" }, { char: "🏄🏼‍♂️" }, { char: "🏄🏽‍♂️" }, { char: "🏄🏾‍♂️" }, { char: "🏄🏿‍♂️" }, { char: "🏄‍♀️" }, { char: "🏄🏻‍♀️" }, { char: "🏄🏼‍♀️" }, { char: "🏄🏽‍♀️" }, { char: "🏄🏾‍♀️" }, { char: "🏄🏿‍♀️" }, { char: "🚣" }, { char: "🚣🏻" }, { char: "🚣🏼" }, { char: "🚣🏽" }, { char: "🚣🏾" }, { char: "🚣🏿" }, { char: "🚣‍♂️" }, { char: "🚣🏻‍♂️" }, { char: "🚣🏼‍♂️" }, { char: "🚣🏽‍♂️" }, { char: "🚣🏾‍♂️" }, { char: "🚣🏿‍♂️" }, { char: "🚣‍♀️" }, { char: "🚣🏻‍♀️" }, { char: "🚣🏼‍♀️" }, { char: "🚣🏽‍♀️" }, { char: "🚣🏾‍♀️" }, { char: "🚣🏿‍♀️" }, { char: "🏊" }, { char: "🏊🏻" }, { char: "🏊🏼" }, { char: "🏊🏽" }, { char: "🏊🏾" }, { char: "🏊🏿" }, { char: "🏊‍♂️" }, { char: "🏊🏻‍♂️" }, { char: "🏊🏼‍♂️" }, { char: "🏊🏽‍♂️" }, { char: "🏊🏾‍♂️" }, { char: "🏊🏿‍♂️" }, { char: "🏊‍♀️" }, { char: "🏊🏻‍♀️" }, { char: "🏊🏼‍♀️" }, { char: "🏊🏽‍♀️" }, { char: "🏊🏾‍♀️" }, { char: "🏊🏿‍♀️" }, { char: "⛹" }, { char: "⛹🏻" }, { char: "⛹🏼" }, { char: "⛹🏽" }, { char: "⛹🏾" }, { char: "⛹🏿" }, { char: "⛹️‍♂️" }, { char: "⛹🏻‍♂️" }, { char: "⛹🏼‍♂️" }, { char: "⛹🏽‍♂️" }, { char: "⛹🏾‍♂️" }, { char: "⛹🏿‍♂️" }, { char: "⛹️‍♀️" }, { char: "⛹🏻‍♀️" }, { char: "⛹🏼‍♀️" }, { char: "⛹🏽‍♀️" }, { char: "⛹🏾‍♀️" }, { char: "⛹🏿‍♀️" }, { char: "🏋" }, { char: "🏋🏻" }, { char: "🏋🏼" }, { char: "🏋🏽" }, { char: "🏋🏾" }, { char: "🏋🏿" }, { char: "🏋️‍♂️" }, { char: "🏋🏻‍♂️" }, { char: "🏋🏼‍♂️" }, { char: "🏋🏽‍♂️" }, { char: "🏋🏾‍♂️" }, { char: "🏋🏿‍♂️" }, { char: "🏋️‍♀️" }, { char: "🏋🏻‍♀️" }, { char: "🏋🏼‍♀️" }, { char: "🏋🏽‍♀️" }, { char: "🏋🏾‍♀️" }, { char: "🏋🏿‍♀️" }, { char: "🚴" }, { char: "🚴🏻" }, { char: "🚴🏼" }, { char: "🚴🏽" }, { char: "🚴🏾" }, { char: "🚴🏿" }, { char: "🚴‍♂️" }, { char: "🚴🏻‍♂️" }, { char: "🚴🏼‍♂️" }, { char: "🚴🏽‍♂️" }, { char: "🚴🏾‍♂️" }, { char: "🚴🏿‍♂️" }, { char: "🚴‍♀️" }, { char: "🚴🏻‍♀️" }, { char: "🚴🏼‍♀️" }, { char: "🚴🏽‍♀️" }, { char: "🚴🏾‍♀️" }, { char: "🚴🏿‍♀️" }, { char: "🚵" }, { char: "🚵🏻" }, { char: "🚵🏼" }, { char: "🚵🏽" }, { char: "🚵🏾" }, { char: "🚵🏿" }, { char: "🚵‍♂️" }, { char: "🚵🏻‍♂️" }, { char: "🚵🏼‍♂️" }, { char: "🚵🏽‍♂️" }, { char: "🚵🏾‍♂️" }, { char: "🚵🏿‍♂️" }, { char: "🚵‍♀️" }, { char: "🚵🏻‍♀️" }, { char: "🚵🏼‍♀️" }, { char: "🚵🏽‍♀️" }, { char: "🚵🏾‍♀️" }, { char: "🚵🏿‍♀️" }, { char: "🏎" }, { char: "🏍" }, { char: "🤸" }, { char: "🤸🏻" }, { char: "🤸🏼" }, { char: "🤸🏽" }, { char: "🤸🏾" }, { char: "🤸🏿" }, { char: "🤸‍♂️" }, { char: "🤸🏻‍♂️" }, { char: "🤸🏼‍♂️" }, { char: "🤸🏽‍♂️" }, { char: "🤸🏾‍♂️" }, { char: "🤸🏿‍♂️" }, { char: "🤸‍♀️" }, { char: "🤸🏻‍♀️" }, { char: "🤸🏼‍♀️" }, { char: "🤸🏽‍♀️" }, { char: "🤸🏾‍♀️" }, { char: "🤸🏿‍♀️" }, { char: "🤼" }, { char: "🤼‍♂️" }, { char: "🤼‍♀️" }, { char: "🤽" }, { char: "🤽🏻" }, { char: "🤽🏼" }, { char: "🤽🏽" }, { char: "🤽🏾" }, { char: "🤽🏿" }, { char: "🤽‍♂️" }, { char: "🤽🏻‍♂️" }, { char: "🤽🏼‍♂️" }, { char: "🤽🏽‍♂️" }, { char: "🤽🏾‍♂️" }, { char: "🤽🏿‍♂️" }, { char: "🤽‍♀️" }, { char: "🤽🏻‍♀️" }, { char: "🤽🏼‍♀️" }, { char: "🤽🏽‍♀️" }, { char: "🤽🏾‍♀️" }, { char: "🤽🏿‍♀️" }, { char: "🤾" }, { char: "🤾🏻" }, { char: "🤾🏼" }, { char: "🤾🏽" }, { char: "🤾🏾" }, { char: "🤾🏿" }, { char: "🤾‍♂️" }, { char: "🤾🏻‍♂️" }, { char: "🤾🏼‍♂️" }, { char: "🤾🏽‍♂️" }, { char: "🤾🏾‍♂️" }, { char: "🤾🏿‍♂️" }, { char: "🤾‍♀️" }, { char: "🤾🏻‍♀️" }, { char: "🤾🏼‍♀️" }, { char: "🤾🏽‍♀️" }, { char: "🤾🏾‍♀️" }, { char: "🤾🏿‍♀️" }, { char: "🤹" }, { char: "🤹🏻" }, { char: "🤹🏼" }, { char: "🤹🏽" }, { char: "🤹🏾" }, { char: "🤹🏿" }, { char: "🤹‍♂️" }, { char: "🤹🏻‍♂️" }, { char: "🤹🏼‍♂️" }, { char: "🤹🏽‍♂️" }, { char: "🤹🏾‍♂️" }, { char: "🤹🏿‍♂️" }, { char: "🤹‍♀️" }, { char: "🤹🏻‍♀️" }, { char: "🤹🏼‍♀️" }, { char: "🤹🏽‍♀️" }, { char: "🤹🏾‍♀️" }, { char: "🤹🏿‍♀️" }, 
               { char: "👫" }, { char: "👬" }, { char: "👭" }, { char: "💏" }, { char: "👩‍❤️‍💋‍👨" }, { char: "👨‍❤️‍💋‍👨" }, { char: "👩‍❤️‍💋‍👩" }, { char: "💑" }, { char: "👩‍❤️‍👨" }, { char: "👨‍❤️‍👨" }, { char: "👩‍❤️‍👩" }, { char: "👪" }, { char: "👨‍👩‍👦" }, { char: "👨‍👩‍👧" }, { char: "👨‍👩‍👧‍👦" }, { char: "👨‍👩‍👦‍👦" }, { char: "👨‍👩‍👧‍👧" }, { char: "👨‍👨‍👦" }, { char: "👨‍👨‍👧" }, { char: "👨‍👨‍👧‍👦" }, { char: "👨‍👨‍👦‍👦" }, { char: "👨‍👨‍👧‍👧" }, { char: "👩‍👩‍👦" }, { char: "👩‍👩‍👧" }, { char: "👩‍👩‍👧‍👦" }, { char: "👩‍👩‍👦‍👦" }, { char: "👩‍👩‍👧‍👧" }, { char: "👨‍👦" }, { char: "👨‍👦‍👦" }, { char: "👨‍👧" }, { char: "👨‍👧‍👦" }, { char: "👨‍👧‍👧" }, { char: "👩‍👦" }, { char: "👩‍👦‍👦" }, { char: "👩‍👧" }, { char: "👩‍👧‍👦" }, { char: "👩‍👧‍👧" }, { char: "🤳" }, { char: "🤳🏻" }, { char: "🤳🏼" }, { char: "🤳🏽" }, { char: "🤳🏾" }, { char: "🤳🏿" }, { char: "💪" }, { char: "💪🏻" }, { char: "💪🏼" }, { char: "💪🏽" }, { char: "💪🏾" }, { char: "💪🏿" }, { char: "👈" }, { char: "👈🏻" }, { char: "👈🏼" }, { char: "👈🏽" }, { char: "👈🏾" }, { char: "👈🏿" }, { char: "👉" }, { char: "👉🏻" }, { char: "👉🏼" }, { char: "👉🏽" }, { char: "👉🏾" }, { char: "👉🏿" }, { char: "☝" }, { char: "☝🏻" }, { char: "☝🏼" }, { char: "☝🏽" }, { char: "☝🏾" }, { char: "☝🏿" }, { char: "👆" }, { char: "👆🏻" }, { char: "👆🏼" }, { char: "👆🏽" }, { char: "👆🏾" }, { char: "👆🏿" }, { char: "🖕" }, { char: "🖕🏻" }, { char: "🖕🏼" }, { char: "🖕🏽" }, { char: "🖕🏾" }, { char: "🖕🏿" }, { char: "👇" }, { char: "👇🏻" }, { char: "👇🏼" }, { char: "👇🏽" }, { char: "👇🏾" }, { char: "👇🏿" }, { char: "✌" }, { char: "✌🏻" }, { char: "✌🏼" }, { char: "✌🏽" }, { char: "✌🏾" }, { char: "✌🏿" }, { char: "🤞" }, { char: "🤞🏻" }, { char: "🤞🏼" }, { char: "🤞🏽" }, { char: "🤞🏾" }, { char: "🤞🏿" }, { char: "🖖" }, { char: "🖖🏻" }, { char: "🖖🏼" }, { char: "🖖🏽" }, { char: "🖖🏾" }, { char: "🖖🏿" }, { char: "🤘" }, { char: "🤘🏻" }, { char: "🤘🏼" }, { char: "🤘🏽" }, { char: "🤘🏾" }, { char: "🤘🏿" }, { char: "🤙" }, { char: "🤙🏻" }, { char: "🤙🏼" }, { char: "🤙🏽" }, { char: "🤙🏾" }, { char: "🤙🏿" }, { char: "🖐" }, { char: "🖐🏻" }, { char: "🖐🏼" }, { char: "🖐🏽" }, { char: "🖐🏾" }, { char: "🖐🏿" }, { char: "✋" }, { char: "✋🏻" }, { char: "✋🏼" }, { char: "✋🏽" }, { char: "✋🏾" }, { char: "✋🏿" }, { char: "👌" }, { char: "👌🏻" }, { char: "👌🏼" }, { char: "👌🏽" }, { char: "👌🏾" }, { char: "👌🏿" }, { char: "👍" }, { char: "👍🏻" }, { char: "👍🏼" }, { char: "👍🏽" }, { char: "👍🏾" }, { char: "👍🏿" }, { char: "👎" }, { char: "👎🏻" }, { char: "👎🏼" }, { char: "👎🏽" }, { char: "👎🏾" }, { char: "👎🏿" }, { char: "✊" }, { char: "✊🏻" }, { char: "✊🏼" }, { char: "✊🏽" }, { char: "✊🏾" }, { char: "✊🏿" }, { char: "👊" }, { char: "👊🏻" }, { char: "👊🏼" }, { char: "👊🏽" }, { char: "👊🏾" }, { char: "👊🏿" }, { char: "🤛" }, { char: "🤛🏻" }, { char: "🤛🏼" }, { char: "🤛🏽" }, { char: "🤛🏾" }, { char: "🤛🏿" }, { char: "🤜" }, { char: "🤜🏻" }, { char: "🤜🏼" }, { char: "🤜🏽" }, { char: "🤜🏾" }, { char: "🤜🏿" }, { char: "🤚" }, { char: "🤚🏻" }, { char: "🤚🏼" }, { char: "🤚🏽" }, { char: "🤚🏾" }, { char: "🤚🏿" }, { char: "👋" }, { char: "👋🏻" }, { char: "👋🏼" }, { char: "👋🏽" }, { char: "👋🏾" }, { char: "👋🏿" }, { char: "🤟" }, { char: "🤟🏻" }, { char: "🤟🏼" }, { char: "🤟🏽" }, { char: "🤟🏾" }, { char: "🤟🏿" }, { char: "✍" }, { char: "✍🏻" }, { char: "✍🏼" }, { char: "✍🏽" }, { char: "✍🏾" }, { char: "✍🏿" }, { char: "👏" }, { char: "👏🏻" }, { char: "👏🏼" }, { char: "👏🏽" }, { char: "👏🏾" }, { char: "👏🏿" }, { char: "👐" }, { char: "👐🏻" }, { char: "👐🏼" }, { char: "👐🏽" }, { char: "👐🏾" }, { char: "👐🏿" }, { char: "🙌" }, { char: "🙌🏻" }, { char: "🙌🏼" }, { char: "🙌🏽" }, { char: "🙌🏾" }, { char: "🙌🏿" }, { char: "🤲" }, { char: "🤲🏻" }, { char: "🤲🏼" }, { char: "🤲🏽" }, { char: "🤲🏾" }, { char: "🤲🏿" }, { char: "🙏" }, { char: "🙏🏻" }, { char: "🙏🏼" }, { char: "🙏🏽" }, { char: "🙏🏾" }, { char: "🙏🏿" }, { char: "🤝" }, { char: "💅" }, { char: "💅🏻" }, { char: "💅🏼" }, { char: "💅🏽" }, { char: "💅🏾" }, { char: "💅🏿" }, { char: "👂" }, { char: "👂🏻" }, { char: "👂🏼" }, { char: "👂🏽" }, { char: "👂🏾" }, { char: "👂🏿" }, { char: "👃" }, { char: "👃🏻" }, { char: "👃🏼" }, { char: "👃🏽" }, { char: "👃🏾" }, { char: "👃🏿" }, { char: "👣" }, { char: "👀" }, { char: "👁️" }, { char: "👁️‍🗨️" }, 
               { char: "🧠" }, { char: "👅" }, { char: "👄" }, { char: "💋" }, { char: "💘" }, { char: "❤️" }, { char: "💓" }, { char: "💔" }, { char: "💕" }, { char: "💖" }, { char: "💗" }, { char: "💙" }, { char: "💚" }, { char: "💛" }, { char: "🧡" }, { char: "💜" }, { char: "🖤" }, { char: "💝" }, { char: "💞" }, { char: "💟" }, { char: "❣️" }, { char: "💌" }, { char: "💤" }, { char: "💢" }, { char: "💣" }, { char: "💥" }, { char: "💦" }, { char: "💨" }, { char: "💫" }, { char: "💬" }, { char: "🗨️" }, { char: "🗯️" }, { char: "💭" }, { char: "🕳️" }, { char: "👓" }, { char: "🕶️" }, { char: "👔" }, { char: "👕" }, { char: "👖" }, { char: "🧣" }, { char: "🧤" }, { char: "🧥" }, { char: "🧦" }, { char: "👗" }, { char: "👘" }, { char: "👙" }, { char: "👚" }, { char: "👛" }, { char: "👜" }, { char: "👝" }, { char: "🛍" }, { char: "🎒" }, { char: "👞" }, { char: "👟" }, { char: "👠" }, { char: "👡" }, { char: "👢" }, { char: "👑" }, { char: "👒" }, { char: "🎩" }, { char: "🎓" }, { char: "🧢" }, { char: "⛑️" }, { char: "📿" }, { char: "💄" }, { char: "💍" }, { char: "💎" }],
    animals = [{ char: "🐵" }, { char: "🐒" }, { char: "🦍" }, { char: "🐶" }, { char: "🐕" }, { char: "🐩" }, { char: "🐺" }, { char: "🦊" }, { char: "🐱" }, { char: "🐈" }, { char: "🦁" }, { char: "🐯" }, { char: "🐅" }, { char: "🐆" }, { char: "🐴" }, { char: "🐎" }, { char: "🦄" }, { char: "🦓" }, { char: "🦌" }, { char: "🐮" }, { char: "🐂" }, { char: "🐃" }, { char: "🐄" }, { char: "🐷" }, { char: "🐖" }, { char: "🐗" }, { char: "🐽" }, { char: "🐏" }, { char: "🐑" }, { char: "🐐" }, { char: "🐪" }, { char: "🐫" }, { char: "🦒" }, { char: "🐘" }, { char: "🦏" }, { char: "🐭" }, { char: "🐁" }, { char: "🐀" }, { char: "🐹" }, { char: "🐰" }, { char: "🐇" }, { char: "🐿️" }, { char: "🦔" }, { char: "🦇" }, { char: "🐻" }, { char: "🐨" }, { char: "🐼" }, { char: "🐾" }, { char: "🦃" }, { char: "🐔" }, { char: "🐓" }, { char: "🐣" }, { char: "🐤" }, { char: "🐥" }, { char: "🐦" }, { char: "🐧" }, { char: "🕊️" }, { char: "🦅" }, { char: "🦆" }, { char: "🦉" }, { char: "🐸" }, { char: "🐊" }, { char: "🐢" }, { char: "🦎" }, { char: "🐍" }, { char: "🐲" }, { char: "🐉" }, { char: "🦕" }, { char: "🦖" }, { char: "🐳" }, { char: "🐋" }, { char: "🐬" }, { char: "🐟" }, { char: "🐠" }, { char: "🐡" }, { char: "🦈" }, { char: "🐙" }, { char: "🐚" }, { char: "🦀" }, { char: "🦐" }, { char: "🦑" }, { char: "🐌" }, { char: "🦋" }, { char: "🐛" }, { char: "🐜" }, { char: "🐝" }, { char: "🐞" }, { char: "🦗" }, { char: "🕷️" }, { char: "🕸️" }, { char: "🦂" }, { char: "💐" }, { char: "🌸" }, { char: "💮" }, { char: "🏵️" }, { char: "🌹" }, { char: "🥀" }, { char: "🌺" }, { char: "🌻" }, { char: "🌼" }, { char: "🌷" }, { char: "🌱" }, { char: "🌲" }, { char: "🌳" }, { char: "🌴" }, { char: "🌵" }, { char: "🌾" }, { char: "🌿" }, { char: "☘" }, { char: "🍀" }, { char: "🍁" }, { char: "🍂" }, { char: "🍃" }],
    food = [{ char: "🍇" }, { char: "🍈" }, { char: "🍉" }, { char: "🍊" }, { char: "🍋" }, { char: "🍌" }, { char: "🍍" }, { char: "🍎" }, { char: "🍏" }, { char: "🍐" }, { char: "🍑" }, { char: "🍒" }, { char: "🍓" }, { char: "🥝" }, { char: "🍅" }, { char: "🥥" }, { char: "🥑" }, { char: "🍆" }, { char: "🥔" }, { char: "🥕" }, { char: "🌽" }, { char: "🌶️" }, { char: "🥒" }, { char: "🥦" }, { char: "🍄" }, { char: "🥜" }, { char: "🌰" }, { char: "🍞" }, { char: "🥐" }, { char: "🥖" }, { char: "🥨" }, { char: "🥞" }, { char: "🧀" }, { char: "🍖" }, { char: "🍗" }, { char: "🥩" }, { char: "🥓" }, { char: "🍔" }, { char: "🍟" }, { char: "🍕" }, { char: "🌭" }, { char: "🥪" }, { char: "🌮" }, { char: "🌯" }, { char: "🥙" }, { char: "🥚" }, { char: "🍳" }, { char: "🥘" }, { char: "🍲" }, { char: "🥣" }, { char: "🥗" }, { char: "🍿" }, { char: "🥫" }, { char: "🍱" }, { char: "🍘" }, { char: "🍙" }, { char: "🍚" }, { char: "🍛" }, { char: "🍜" }, { char: "🍝" }, { char: "🍠" }, { char: "🍢" }, { char: "🍣" }, { char: "🍤" }, { char: "🍥" }, { char: "🍡" }, { char: "🥟" }, { char: "🥠" }, { char: "🥡" }, { char: "🍦" }, { char: "🍧" }, { char: "🍨" }, { char: "🍩" }, { char: "🍪" }, { char: "🎂" }, { char: "🍰" }, { char: "🥧" }, { char: "🍫" }, { char: "🍬" }, { char: "🍭" }, { char: "🍮" }, { char: "🍯" }, { char: "🍼" }, { char: "🥛" }, { char: "☕" }, { char: "🍵" }, { char: "🍶" }, { char: "🍾" }, { char: "🍷" }, { char: "🍸" }, { char: "🍹" }, { char: "🍺" }, { char: "🍻" }, { char: "🥂" }, { char: "🥃" }, { char: "🥤" }, { char: "🥢" }, { char: "🍽️" }, { char: "🍴" }, { char: "🥄" }, { char: "🔪" }, { char: "🏺" }],
    travel = [{ char: "🌍" }, { char: "🌎" }, { char: "🌏" }, { char: "🌐" }, { char: "🗺️" }, { char: "🗾" }, { char: "🏔️" }, { char: "⛰️" }, { char: "🌋" }, { char: "🗻" }, { char: "🏕️" }, { char: "🏖️" }, { char: "🏜️" }, { char: "🏝️" }, { char: "🏞️" }, { char: "🏟️" }, { char: "🏛️" }, { char: "🏗️" }, { char: "🏘️" }, { char: "🏙️" }, { char: "🏚️" }, { char: "🏠" }, { char: "🏡" }, { char: "🏢" }, { char: "🏣" }, { char: "🏤" }, { char: "🏥" }, { char: "🏦" }, { char: "🏨" }, { char: "🏩" }, { char: "🏪" }, { char: "🏫" }, { char: "🏬" }, { char: "🏭" }, { char: "🏯" }, { char: "🏰" }, { char: "💒" }, { char: "🗼" }, { char: "🗽" }, { char: "⛪" }, { char: "🕌" }, { char: "🕍" }, { char: "⛩️" }, { char: "🕋" }, { char: "⛲" }, { char: "⛺" }, { char: "🌁" }, { char: "🌃" }, { char: "🌄" }, { char: "🌅" }, { char: "🌆" }, { char: "🌇" }, { char: "🌉" }, { char: "♨️" }, { char: "🌌" }, { char: "🎠" }, { char: "🎡" }, { char: "🎢" }, { char: "💈" }, { char: "🎪" }, { char: "🚂" }, { char: "🚃" }, { char: "🚄" }, { char: "🚅" }, { char: "🚆" }, { char: "🚇" }, { char: "🚈" }, { char: "🚉" }, { char: "🚊" }, { char: "🚝" }, { char: "🚞" }, { char: "🚋" }, { char: "🚌" }, { char: "🚍" }, { char: "🚎" }, { char: "🚐" }, { char: "🚑" }, { char: "🚒" }, { char: "🚓" }, { char: "🚔" }, { char: "🚕" }, { char: "🚖" }, { char: "🚗" }, { char: "🚘" }, { char: "🚙" }, { char: "🚚" }, { char: "🚛" }, { char: "🚜" }, { char: "🚲" }, { char: "🛴" }, { char: "🛵" }, { char: "🚏" }, { char: "🛣️" }, { char: "🛤️" }, { char: "⛽" }, { char: "🚨" }, { char: "🚥" }, { char: "🚦" }, { char: "🚧" }, { char: "🛑" }, { char: "⚓" }, { char: "⛵" }, { char: "🛶" }, { char: "🚤" }, { char: "🛳️" }, { char: "⛴️" }, { char: "🛥️" }, { char: "🚢" }, { char: "✈️" }, { char: "🛩️" }, { char: "🛫" }, { char: "🛬" }, { char: "💺" }, { char: "🚁" }, { char: "🚟" }, { char: "🚠" }, { char: "🚡" }, { char: "🛰️" }, { char: "🚀" }, { char: "🛸" }, { char: "🛎️" }, { char: "🚪" }, { char: "🛏️" }, { char: "🛋️" }, { char: "🚽" }, { char: "🚿" }, { char: "🛁" }, { char: "⌛" }, { char: "⏳" }, { char: "⌚" }, { char: "⏰" }, { char: "⏱" }, { char: "⏲" }, { char: "🕰️" }, { char: "🕛" }, { char: "🕧" }, { char: "🕐" }, { char: "🕜" }, { char: "🕑" }, { char: "🕝" }, { char: "🕒" }, { char: "🕞" }, { char: "🕓" }, { char: "🕟" }, { char: "🕔" }, { char: "🕠" }, { char: "🕕" }, { char: "🕡" }, { char: "🕖" }, { char: "🕢" }, { char: "🕗" }, { char: "🕣" }, { char: "🕘" }, { char: "🕤" }, { char: "🕙" }, { char: "🕥" }, { char: "🕚" }, { char: "🕦" }, { char: "🌑" }, { char: "🌒" }, { char: "🌓" }, { char: "🌔" }, { char: "🌕" }, { char: "🌖" }, { char: "🌗" }, { char: "🌘" }, { char: "🌙" }, { char: "🌚" }, { char: "🌛" }, { char: "🌜" }, { char: "🌡️" }, { char: "☀️" }, { char: "🌝" }, { char: "🌞" }, { char: "⭐" }, { char: "🌟" }, { char: "🌠" }, { char: "☁️" }, { char: "⛅" }, { char: "⛈️" }, { char: "🌤️" }, { char: "🌥️" }, { char: "🌦️" }, { char: "🌧️" }, { char: "🌨️" }, { char: "🌩️" }, { char: "🌪️" }, { char: "🌫️" }, { char: "🌬️" }, { char: "🌀" }, { char: "🌈" }, { char: "🌂" }, { char: "☂️" }, { char: "☔" }, { char: "⛱️" }, { char: "⚡" }, { char: "❄️" }, { char: "☃️" }, { char: "⛄" }, { char: "☄️" }, { char: "🔥" }, { char: "💧" }, { char: "🌊" }],
    activities = [{ char: "🎃" }, { char: "🎄" }, { char: "🎆" }, { char: "🎇" }, { char: "✨" }, { char: "🎈" }, { char: "🎉" }, { char: "🎊" }, { char: "🎋" }, { char: "🎍" }, { char: "🎎" }, { char: "🎏" }, { char: "🎐" }, { char: "🎑" }, { char: "🎀" }, { char: "🎁" }, { char: "🎗️" }, { char: "🎟️" }, { char: "🎫" }, { char: "🎖️" }, { char: "🏆" }, { char: "🏅" }, { char: "🥇" }, { char: "🥈" }, { char: "🥉" }, { char: "⚽" }, { char: "⚾" }, { char: "🏀" }, { char: "🏐" }, { char: "🏈" }, { char: "🏉" }, { char: "🎾" }, { char: "🎱" }, { char: "🎳" }, { char: "🏏" }, { char: "🏑" }, { char: "🏒" }, { char: "🏓" }, { char: "🏸" }, { char: "🥊" }, { char: "🥋" }, { char: "🥅" }, { char: "🎯" }, { char: "⛳" }, { char: "⛸️" }, { char: "🎣" }, { char: "🎽" }, { char: "🎿" }, { char: "🛷" }, { char: "🥌" }, { char: "🎮" }, { char: "🕹️" }, { char: "🎰" }, { char: "🎲" }, { char: "♠" }, { char: "♥" }, { char: "♦" }, { char: "♣" }, { char: "🃏" }, { char: "🀄" }, { char: "🎴" }, { char: "🎭" }, { char: "🖼️" }, { char: "🎨" }],
    objects = [{ char: "🔇" }, { char: "🔈" }, { char: "🔉" }, { char: "🔊" }, { char: "📢" }, { char: "📣" }, { char: "📯" }, { char: "🔔" }, { char: "🔕" }, { char: "🎼" }, { char: "🎵" }, { char: "🎶" }, { char: "🎙️" }, { char: "🎚️" }, { char: "🎛️" }, { char: "🎤" }, { char: "🎧" }, { char: "📻" }, { char: "🎷" }, { char: "🎸" }, { char: "🎹" }, { char: "🎺" }, { char: "🎻" }, { char: "🥁" }, { char: "📱" }, { char: "📲" }, { char: "☎️" }, { char: "📞" }, { char: "📟" }, { char: "📠" }, { char: "🔋" }, { char: "🔌" }, { char: "💻" }, { char: "🖥️" }, { char: "🖨️" }, { char: "⌨️" }, { char: "🖱️" }, { char: "🖲️" }, { char: "💽" }, { char: "💾" }, { char: "💿" }, { char: "📀" }, { char: "🎥" }, { char: "🎞️" }, { char: "📽️" }, { char: "🎬" }, { char: "📺" }, { char: "📷" }, { char: "📸" }, { char: "📹" }, { char: "📼" }, { char: "🔍" }, { char: "🔎" }, { char: "🔬" }, { char: "🔭" }, { char: "📡" }, { char: "🕯️" }, { char: "💡" }, { char: "🔦" }, { char: "🏮" }, { char: "📔" }, { char: "📕" }, { char: "📖" }, { char: "📗" }, { char: "📘" }, { char: "📙" }, { char: "📚" }, { char: "📓" }, { char: "📒" }, { char: "📃" }, { char: "📜" }, { char: "📄" }, { char: "📰" }, { char: "🗞️" }, { char: "📑" }, { char: "🔖" }, { char: "🏷️" }, { char: "💰" }, { char: "💴" }, { char: "💵" }, { char: "💶" }, { char: "💷" }, { char: "💸" }, { char: "💳" }, { char: "💹" }, { char: "💱" }, { char: "💲" }, { char: "️✉️" }, { char: "📧" }, { char: "📨" }, { char: "📩" }, { char: "📤" }, { char: "📥" }, { char: "📦" }, { char: "📫" }, { char: "📪" }, { char: "📬" }, { char: "📭" }, { char: "📮" }, { char: "🗳️" }, { char: "✏️" }, { char: "✒️" }, { char: "🖋️" }, { char: "🖊️" }, { char: "🖌️" }, { char: "🖍️" }, { char: "📝" }, { char: "💼" }, { char: "📁" }, { char: "📂" }, { char: "🗂️" }, { char: "📅" }, { char: "📆" }, { char: "🗒️" }, { char: "🗓️" }, { char: "📇" }, { char: "📈" }, { char: "📉" }, { char: "📊" }, { char: "📋" }, { char: "📌" }, { char: "📍" }, { char: "📎" }, { char: "🖇️" }, { char: "📏" }, { char: "📐" }, { char: "✂️" }, { char: "🗃️" }, { char: "🗄️" }, { char: "🗑️" }, { char: "🔒" }, { char: "🔓" }, { char: "🔏" }, { char: "🔐" }, { char: "🔑" }, { char: "🗝️" }, { char: "🔨" }, { char: "⛏️" }, { char: "⚒️" }, { char: "🛠️" }, { char: "🗡️" }, { char: "⚔️" }, { char: "🔫" }, { char: "🏹" }, { char: "🛡️" }, { char: "🔧" }, { char: "🔩" }, { char: "⚙️" }, { char: "🗜️" }, { char: "⚗️" }, { char: "⚖️" }, { char: "🔗" }, { char: "⛓️" }, { char: "💉" }, { char: "💊" }, { char: "🚬" }, { char: "⚰️" }, { char: "⚱️" }, { char: "🗿" }],
    symbols = [{ char: "🛢️" }, { char: "🔮" }, { char: "🛒" }, { char: "🏧" }, { char: "🚮" }, { char: "🚰" }, { char: "♿" }, { char: "🚹" }, { char: "🚺" }, { char: "🚻" }, { char: "🚼" }, { char: "🚾" }, { char: "🛂" }, { char: "🛃" }, { char: "🛄" }, { char: "🛅" }, { char: "⚠️" }, { char: "🚸" }, { char: "⛔" }, { char: "🚫" }, { char: "🚳" }, { char: "🚭" }, { char: "🚯" }, { char: "🚱" }, { char: "🚷" }, { char: "📵" }, { char: "🔞" }, { char: "☢️" }, { char: "☣️" }, { char: "⬆️" }, { char: "↗️" }, { char: "➡️" }, { char: "↘️" }, { char: "⬇️" }, { char: "↙️" }, { char: "⬅️" }, { char: "↖️" }, { char: "↕️" }, { char: "↔️" }, { char: "↩️" }, { char: "↪️" }, { char: "⤴️" }, { char: "⤵️" }, { char: "🔃" }, { char: "🔄" }, { char: "🔙" }, { char: "🔚" }, { char: "🔛" }, { char: "🔜" }, { char: "🔝" }, { char: "🛐" }, { char: "⚛️" }, { char: "🕉️" }, { char: "✡️" }, { char: "☸️" }, { char: "☯️" }, { char: "✝️" }, { char: "☦️" }, { char: "☪️" }, { char: "☮️" }, { char: "🕎" }, { char: "🔯" }, { char: "♈" }, { char: "♉" }, { char: "♊" }, { char: "♋" }, { char: "♌" }, { char: "♍" }, { char: "♎" }, { char: "♏" }, { char: "♐" }, { char: "♑" }, { char: "♒" }, { char: "♓" }, { char: "⛎" }, { char: "🔀" }, { char: "🔁" }, { char: "🔂" }, { char: "▶" }, { char: "⏩" }, { char: "⏭" }, { char: "⏯" }, { char: "◀" }, { char: "⏪" }, { char: "⏮" }, { char: "🔼" }, { char: "⏫" }, { char: "🔽" }, { char: "⏬" }, { char: "⏸" }, { char: "⏹" }, { char: "⏺" }, { char: "⏏️" }, { char: "🎦" }, { char: "🔅" }, { char: "🔆" }, { char: "📶" }, { char: "📳" }, { char: "📴" }, { char: "♀" }, { char: "♂" }, { char: "⚕️" }, { char: "♻️" }, { char: "⚜️" }, { char: "🔱" }, { char: "📛" }, { char: "🔰" }, { char: "⭕" }, { char: "✅" }, { char: "☑️" }, { char: "✔️" }, { char: "✖️" }, { char: "❌" }, { char: "❎" }, { char: "➕" }, { char: "➖" }, { char: "➗" }, { char: "➰" }, { char: "➿" }, { char: "〽️" }, { char: "✳️" }, { char: "✴️" }, { char: "❇️" }, { char: "‼️" }, { char: "⁉️" }, { char: "❓" }, { char: "❔" }, { char: "❕" }, { char: "❗" }, { char: "〰" }, { char: "©" }, { char: "®" }, { char: "™" }, { char: "#️⃣" }, { char: "*️⃣" }, { char: "0️⃣" }, { char: "1️⃣" }, { char: "2️⃣" }, { char: "3️⃣" }, { char: "4️⃣" }, { char: "5️⃣" }, { char: "6️⃣" }, { char: "7️⃣" }, { char: "8️⃣" }, { char: "9️⃣" }, { char: "🔟" }, { char: "💯" }, { char: "🔠" }, { char: "🔡" }, { char: "🔢" }, { char: "🔣" }, { char: "🔤" }, { char: "🅰" }, { char: "🆎" }, { char: "🅱" }, { char: "🆑" }, { char: "🆒" }, { char: "🆓" }, { char: "ℹ" }, { char: "🆔" }, { char: "Ⓜ" }, { char: "🆕" }, { char: "🆖" }, { char: "🅾" }, { char: "🆗" }, { char: "🅿" }, { char: "🆘" }, { char: "🆙" }, { char: "🆚" }, { char: "🈁" }, { char: "🈂" }, { char: "🈷" }, { char: "🈶" }, { char: "🈯" }, { char: "🉐" }, { char: "🈹" }, { char: "🈚" }, { char: "🈲" }, { char: "🉑" }, { char: "🈸" }, { char: "🈴" }, { char: "🈳" }, { char: "㊗" }, { char: "㊙" }, { char: "🈺" }, { char: "🈵" }, { char: "▪" }, { char: "▫" }, { char: "◻" }, { char: "◼" }, { char: "◽" }, { char: "◾" }, { char: "⬛" }, { char: "⬜" }, { char: "🔶" }, { char: "🔷" }, { char: "🔸" }, { char: "🔹" }, { char: "🔺" }, { char: "🔻" }, { char: "💠" }, { char: "🔘" }, { char: "🔲" }, { char: "🔳" }, { char: "⚪" }, { char: "⚫" }, { char: "🔴" }, { char: "🔵" }],
    flags = [{ char: "🏁" }, { char: "🚩" }, { char: "🎌" }, { char: "🏴" }, { char: "🏳" }, { char: "🏳️‍🌈" }, { char: "🇦🇨" }, { char: "🇦🇩" }, { char: "🇦🇪" }, { char: "🇦🇫" }, { char: "🇦🇬" }, { char: "🇦🇮" }, { char: "🇦🇱" }, { char: "🇦🇲" }, { char: "🇦🇴" }, { char: "🇦🇶" }, { char: "🇦🇷" }, { char: "🇦🇸" }, { char: "🇦🇹" }, { char: "🇦🇺" }, { char: "🇦🇼" }, { char: "🇦🇽" }, { char: "🇦🇿" }, { char: "🇧🇦" }, { char: "🇧🇧" }, { char: "🇧🇩" }, { char: "🇧🇪" }, { char: "🇧🇫" }, { char: "🇧🇬" }, { char: "🇧🇭" }, { char: "🇧🇮" }, { char: "🇧🇯" }, { char: "🇧🇱" }, { char: "🇧🇲" }, { char: "🇧🇳" }, { char: "🇧🇴" }, { char: "🇧🇶" }, { char: "🇧🇷" }, { char: "🇧🇸" }, { char: "🇧🇹" }, { char: "🇧🇻" }, { char: "🇧🇼" }, { char: "🇧🇾" }, { char: "🇧🇿" }, { char: "🇨🇦" }, { char: "🇨🇨" }, { char: "🇨🇩" }, { char: "🇨🇫" }, { char: "🇨🇬" }, { char: "🇨🇭" }, { char: "🇨🇮" }, { char: "🇨🇰" }, { char: "🇨🇱" }, { char: "🇨🇲" }, { char: "🇨🇳" }, { char: "🇨🇴" }, { char: "🇨🇵" }, { char: "🇨🇷" }, { char: "🇨🇺" }, { char: "🇨🇻" }, { char: "🇨🇼" }, { char: "🇨🇽" }, { char: "🇨🇾" }, { char: "🇨🇿" }, { char: "🇩🇪" }, { char: "🇩🇬" }, { char: "🇩🇯" }, { char: "🇩🇰" }, { char: "🇩🇲" }, { char: "🇩🇴" }, { char: "🇩🇿" }, { char: "🇪🇦" }, { char: "🇪🇨" }, { char: "🇪🇪" }, { char: "🇪🇬" }, { char: "🇪🇭" }, { char: "🇪🇷" }, { char: "🇪🇸" }, { char: "🇪🇹" }, { char: "🇪🇺" }, { char: "🇫🇮" }, { char: "🇫🇯" }, { char: "🇫🇰" }, { char: "🇫🇲" }, { char: "🇫🇴" }, { char: "🇫🇷" }, { char: "🇬🇦" }, { char: "🇬🇧" }, { char: "🇬🇩" }, { char: "🇬🇪" }, { char: "🇬🇫" }, { char: "🇬🇬" }, { char: "🇬🇭" }, { char: "🇬🇮" }, { char: "🇬🇱" }, { char: "🇬🇲" }, { char: "🇬🇳" }, { char: "🇬🇵" }, { char: "🇬🇶" }, { char: "🇬🇷" }, { char: "🇬🇸" }, { char: "🇬🇹" }, { char: "🇬🇺" }, { char: "🇬🇼" }, { char: "🇬🇾" }, { char: "🇭🇰" }, { char: "🇭🇲" }, { char: "🇭🇳" }, { char: "🇭🇷" }, { char: "🇭🇹" }, { char: "🇭🇺" }, { char: "🇮🇨" }, { char: "🇮🇩" }, { char: "🇮🇪" }, { char: "🇮🇱" }, { char: "🇮🇲" }, { char: "🇮🇳" }, { char: "🇮🇴" }, { char: "🇮🇶" }, { char: "🇮🇷" }, { char: "🇮🇸" }, { char: "🇮🇹" }, { char: "🇯🇪" }, { char: "🇯🇲" }, { char: "🇯🇴" }, { char: "🇯🇵" }, { char: "🇰🇪" }, { char: "🇰🇬" }, { char: "🇰🇭" }, { char: "🇰🇮" }, { char: "🇰🇲" }, { char: "🇰🇳" }, { char: "🇰🇵" }, { char: "🇰🇷" }, { char: "🇰🇼" }, { char: "🇰🇾" }, { char: "🇰🇿" }, { char: "🇱🇦" }, { char: "🇱🇧" }, { char: "🇱🇨" }, { char: "🇱🇮" }, { char: "🇱🇰" }, { char: "🇱🇷" }, { char: "🇱🇸" }, { char: "🇱🇹" }, { char: "🇱🇺" }, { char: "🇱🇻" }, { char: "🇱🇾" }, { char: "🇲🇦" }, { char: "🇲🇨" }, { char: "🇲🇩" }, { char: "🇲🇪" }, { char: "🇲🇫" }, { char: "🇲🇬" }, { char: "🇲🇭" }, { char: "🇲🇰" }, { char: "🇲🇱" }, { char: "🇲🇲" }, { char: "🇲🇳" }, { char: "🇲🇴" }, { char: "🇲🇵" }, { char: "🇲🇶" }, { char: "🇲🇷" }, { char: "🇲🇸" }, { char: "🇲🇹" }, { char: "🇲🇺" }, { char: "🇲🇻" }, { char: "🇲🇼" }, { char: "🇲🇽" }, { char: "🇲🇾" }, { char: "🇲🇿" }, { char: "🇳🇦" }, { char: "🇳🇨" }, { char: "🇳🇪" }, { char: "🇳🇫" }, { char: "🇳🇬" }, { char: "🇳🇮" }, { char: "🇳🇱" }, { char: "🇳🇴" }, { char: "🇳🇵" }, { char: "🇳🇷" }, { char: "🇳🇺" }, { char: "🇳🇿" }, { char: "🇴🇲" }, { char: "🇵🇦" }, { char: "🇵🇪" }, { char: "🇵🇫" }, { char: "🇵🇬" }, { char: "🇵🇭" }, { char: "🇵🇰" }, { char: "🇵🇱" }, { char: "🇵🇲" }, { char: "🇵🇳" }, { char: "🇵🇷" }, { char: "🇵🇸" }, { char: "🇵🇹" }, { char: "🇵🇼" }, { char: "🇵🇾" }, { char: "🇶🇦" }, { char: "🇷🇪" }, { char: "🇷🇴" }, { char: "🇷🇸" }, { char: "🇷🇺" }, { char: "🇷🇼" }, { char: "🇸🇦" }, { char: "🇸🇧" }, { char: "🇸🇨" }, { char: "🇸🇩" }, { char: "🇸🇪" }, { char: "🇸🇬" }, { char: "🇸🇭" }, { char: "🇸🇮" }, { char: "🇸🇯" }, { char: "🇸🇰" }, { char: "🇸🇱" }, { char: "🇸🇲" }, { char: "🇸🇳" }, { char: "🇸🇴" }, { char: "🇸🇷" }, { char: "🇸🇸" }, { char: "🇸🇹" }, { char: "🇸🇻" }, { char: "🇸🇽" }, { char: "🇸🇾" }, { char: "🇸🇿" }, { char: "🇹🇦" }, { char: "🇹🇨" }, { char: "🇹🇩" }, { char: "🇹🇫" }, { char: "🇹🇬" }, { char: "🇹🇭" }, { char: "🇹🇯" }, { char: "🇹🇰" }, { char: "🇹🇱" }, { char: "🇹🇲" }, { char: "🇹🇳" }, { char: "🇹🇴" }, { char: "🇹🇷" }, { char: "🇹🇹" }, { char: "🇹🇻" }, { char: "🇹🇼" }, { char: "🇹🇿" }, { char: "🇺🇦" }, { char: "🇺🇬" }, { char: "🇺🇲" }, { char: "🇺🇳" }, { char: "🇺🇸" }, { char: "🇺🇾" }, { char: "🇺🇿" }, { char: "🇻🇦" }, { char: "🇻🇨" }, { char: "🇻🇪" }, { char: "🇻🇬" }, { char: "🇻🇮" }, { char: "🇻🇳" }, { char: "🇻🇺" }, { char: "🇼🇫" }, { char: "🇼🇸" }, { char: "🇽🇰" }, { char: "🇾🇪" }, { char: "🇾🇹" }, { char: "🇿🇦" }, { char: "🇿🇲" }];

var select = document.getElementsByClassName("em");
var sellen = select.length;
var yy = 0;
var category;
var len;
let z;
var ini = 0;
var mmm = 0;
var aaa = 0;
var ttt = 0;
var act = 0;
var ooo = 0;
var sss = 0;
var fff = 0;
var b;
let text = document.getElementById("text");
var i = 0;
var smileysset = 0;
var animalsset = 0;
var foodset = 0;
var travelset = 0;
var activitiesset = 0;
var objectsset = 0;
var symbolsset = 0;
var flagsset = 0;
var button;

//default to smileys
document.onload = newswitch("smileys");

//switcher
while (yy < sellen) {
    let n = yy;
    select[yy].addEventListener("click", function() {
        newswitch(n);
    });
    yy++;
}

function newswitch(x) {
    category = select[x].id;
    if (category == "smileys") {
        if (smileysset !== 1) {
            smileyss();
        }
        document.getElementById("smileysdiv").style.display = "";
        document.getElementById("smileyshead").hidden = false;

        document.getElementById("fooddiv").style.display = "none";
        document.getElementById("animalsdiv").style.display = "none";
        document.getElementById("traveldiv").style.display = "none";
        document.getElementById("activitiesdiv").style.display = "none";
        document.getElementById("objectsdiv").style.display = "none";
        document.getElementById("symbolsdiv").style.display = "none";
        document.getElementById("flagsdiv").style.display = "none";

        document.getElementById("foodhead").hidden = true;
        document.getElementById("animalshead").hidden = true;
        document.getElementById("travelhead").hidden = true;
        document.getElementById("activitieshead").hidden = true;
        document.getElementById("objectshead").hidden = true;
        document.getElementById("symbolshead").hidden = true;
        document.getElementById("flagshead").hidden = true;
    }
    if (category == "animals") {
        if (animalsset !== 1) {
            animalss();
        }
        document.getElementById("animalsdiv").style.display = "";
        document.getElementById("animalshead").hidden = false;

        document.getElementById("smileysdiv").style.display = "none";
        document.getElementById("fooddiv").style.display = "none";
        document.getElementById("traveldiv").style.display = "none";
        document.getElementById("activitiesdiv").style.display = "none";
        document.getElementById("objectsdiv").style.display = "none";
        document.getElementById("symbolsdiv").style.display = "none";
        document.getElementById("flagsdiv").style.display = "none";


        document.getElementById("smileyshead").hidden = true;
        document.getElementById("foodhead").hidden = true;
        document.getElementById("travelhead").hidden = true;
        document.getElementById("activitieshead").hidden = true;
        document.getElementById("objectshead").hidden = true;
        document.getElementById("symbolshead").hidden = true;
        document.getElementById("flagshead").hidden = true;
    }
    if (category == "food") {
        if (foodset !== 1) {
            foods();
        }
        document.getElementById("fooddiv").style.display = "";
        document.getElementById("foodhead").hidden = false;

        document.getElementById("smileysdiv").style.display = "none";
        document.getElementById("animalsdiv").style.display = "none";
        document.getElementById("traveldiv").style.display = "none";
        document.getElementById("activitiesdiv").style.display = "none";
        document.getElementById("objectsdiv").style.display = "none";
        document.getElementById("symbolsdiv").style.display = "none";
        document.getElementById("flagsdiv").style.display = "none";

        document.getElementById("smileyshead").hidden = true;
        document.getElementById("animalshead").hidden = true;
        document.getElementById("travelhead").hidden = true;
        document.getElementById("activitieshead").hidden = true;
        document.getElementById("objectshead").hidden = true;
        document.getElementById("symbolshead").hidden = true;
        document.getElementById("flagshead").hidden = true;
    }
    if (category == "travel") {
        if (travelset !== 1) {
            travels();
        }
        document.getElementById("traveldiv").style.display = "";
        document.getElementById("travelhead").hidden = false;

        document.getElementById("smileysdiv").style.display = "none";
        document.getElementById("animalsdiv").style.display = "none";
        document.getElementById("fooddiv").style.display = "none";
        document.getElementById("activitiesdiv").style.display = "none";
        document.getElementById("objectsdiv").style.display = "none";
        document.getElementById("symbolsdiv").style.display = "none";
        document.getElementById("flagsdiv").style.display = "none";

        document.getElementById("smileyshead").hidden = true;
        document.getElementById("animalshead").hidden = true;
        document.getElementById("foodhead").hidden = true;
        document.getElementById("activitieshead").hidden = true;
        document.getElementById("objectshead").hidden = true;
        document.getElementById("symbolshead").hidden = true;
        document.getElementById("flagshead").hidden = true;

    }
    if (category == "activities") {
        if (activitiesset !== 1) {
            activitiess();
        }
        document.getElementById("activitiesdiv").style.display = "";
        document.getElementById("activitieshead").hidden = false;

        document.getElementById("smileysdiv").style.display = "none";
        document.getElementById("animalsdiv").style.display = "none";
        document.getElementById("fooddiv").style.display = "none";
        document.getElementById("traveldiv").style.display = "none";
        document.getElementById("objectsdiv").style.display = "none";
        document.getElementById("symbolsdiv").style.display = "none";
        document.getElementById("flagsdiv").style.display = "none";

        document.getElementById("smileyshead").hidden = true;
        document.getElementById("animalshead").hidden = true;
        document.getElementById("foodhead").hidden = true;
        document.getElementById("travelhead").hidden = true;
        document.getElementById("objectshead").hidden = true;
        document.getElementById("symbolshead").hidden = true;
        document.getElementById("flagshead").hidden = true;

    }
    if (category == "objects") {
        if (objectsset !== 1) {
            objectss();
        }
        document.getElementById("objectsdiv").style.display = "";
        document.getElementById("objectshead").hidden = false;

        document.getElementById("smileysdiv").style.display = "none";
        document.getElementById("animalsdiv").style.display = "none";
        document.getElementById("fooddiv").style.display = "none";
        document.getElementById("traveldiv").style.display = "none";
        document.getElementById("activitiesdiv").style.display = "none";
        document.getElementById("symbolsdiv").style.display = "none";
        document.getElementById("flagsdiv").style.display = "none";

        document.getElementById("smileyshead").hidden = true;
        document.getElementById("animalshead").hidden = true;
        document.getElementById("foodhead").hidden = true;
        document.getElementById("travelhead").hidden = true;
        document.getElementById("activitieshead").hidden = true;
        document.getElementById("symbolshead").hidden = true;
        document.getElementById("flagshead").hidden = true;
    }
    if (category == "symbols") {
        if (symbolsset !== 1) {
            symbolss();
        }
        document.getElementById("symbolsdiv").style.display = "";
        document.getElementById("symbolshead").hidden = false;

        document.getElementById("smileysdiv").style.display = "none";
        document.getElementById("animalsdiv").style.display = "none";
        document.getElementById("fooddiv").style.display = "none";
        document.getElementById("traveldiv").style.display = "none";
        document.getElementById("activitiesdiv").style.display = "none";
        document.getElementById("objectsdiv").style.display = "none";
        document.getElementById("flagsdiv").style.display = "none";


        document.getElementById("smileyshead").hidden = true;
        document.getElementById("animalshead").hidden = true;
        document.getElementById("foodhead").hidden = true;
        document.getElementById("travelhead").hidden = true;
        document.getElementById("activitieshead").hidden = true;
        document.getElementById("objectshead").hidden = true;
        document.getElementById("flagshead").hidden = true;
    }
    if (category == "flags") {
        if (flagsset !== 1) {
            flagss();
        }
        document.getElementById("flagsdiv").style.display = "";
        document.getElementById("flagshead").hidden = false;

        document.getElementById("smileysdiv").style.display = "none";
        document.getElementById("animalsdiv").style.display = "none";
        document.getElementById("fooddiv").style.display = "none";
        document.getElementById("traveldiv").style.display = "none";
        document.getElementById("activitiesdiv").style.display = "none";
        document.getElementById("objectsdiv").style.display = "none";
        document.getElementById("symbolsdiv").style.display = "none";


        document.getElementById("smileyshead").hidden = true;
        document.getElementById("animalshead").hidden = true;
        document.getElementById("foodhead").hidden = true;
        document.getElementById("travelhead").hidden = true;
        document.getElementById("activitieshead").hidden = true;
        document.getElementById("objectshead").hidden = true;
        document.getElementById("symbolshead").hidden = true;
    }
}
//emoji displays
function smileyss() {
    len = smileys.length;
    while (ini < len) {
        var btn = document.createElement("BUTTON");
        btn.setAttribute("class", "smileysemoji");
        btn.setAttribute("id", ini);
        var emojitext = document.createTextNode(smileys[ini].char);
        btn.appendChild(emojitext);
        document.getElementById("smileysdiv").appendChild(btn);
        ini++;
    }
    button = document.getElementsByClassName("smileysemoji");
    addcopy(len, button);
    smileysset = 1;
}

function animalss() {
    len = animals.length;
    while (aaa < len) {
        var btn = document.createElement("BUTTON");
        btn.setAttribute("class", "animalsemoji");
        btn.setAttribute("id", aaa);
        var emojitext = document.createTextNode(animals[aaa].char);
        btn.appendChild(emojitext);
        document.getElementById("animalsdiv").appendChild(btn);
        aaa++;
    }
    button = document.getElementsByClassName("animalsemoji");
    addcopy(len, button);
    animalsset = 1;
}

function foods() {

    len = food.length;
    while (mmm < len) {
        var btn = document.createElement("BUTTON");
        btn.setAttribute("class", "foodemoji");
        btn.setAttribute("id", mmm);
        var emojitext = document.createTextNode(food[mmm].char);
        btn.appendChild(emojitext);
        document.getElementById("fooddiv").appendChild(btn);
        mmm++;
    }
    button = document.getElementsByClassName("foodemoji");
    addcopy(len, button);
    foodset = 1;
}

function travels() {
    len = travel.length;
    while (ttt < len) {
        var btn = document.createElement("BUTTON");
        btn.setAttribute("class", "travelemoji");
        btn.setAttribute("id", ttt);
        var emojitext = document.createTextNode(travel[ttt].char);
        btn.appendChild(emojitext);
        document.getElementById("traveldiv").appendChild(btn);
        ttt++;
    }
    button = document.getElementsByClassName("travelemoji");
    addcopy(len, button);
    travelset = 1;
}

function activitiess() {
    len = activities.length;
    while (act < len) {
        var btn = document.createElement("BUTTON");
        btn.setAttribute("class", "activitiesemoji");
        btn.setAttribute("id", act);
        var emojitext = document.createTextNode(activities[act].char);
        btn.appendChild(emojitext);
        document.getElementById("activitiesdiv").appendChild(btn);
        act++;
    }
    button = document.getElementsByClassName("activitiesemoji");
    addcopy(len, button);
    activitiesset = 1;
}

function objectss() {
    len = objects.length;
    while (ooo < len) {
        var btn = document.createElement("BUTTON");
        btn.setAttribute("class", "objectsemoji");
        btn.setAttribute("id", ooo);
        var emojitext = document.createTextNode(objects[ooo].char);
        btn.appendChild(emojitext);
        document.getElementById("objectsdiv").appendChild(btn);
        ooo++;
    }
    button = document.getElementsByClassName("objectsemoji");
    addcopy(len, button);
    objectsset = 1;
}

function symbolss() {
    len = symbols.length;
    while (sss < len) {
        var btn = document.createElement("BUTTON");
        btn.setAttribute("class", "symbolsemoji");
        btn.setAttribute("id", sss);
        var emojitext = document.createTextNode(symbols[sss].char);
        btn.appendChild(emojitext);
        document.getElementById("symbolsdiv").appendChild(btn);
        sss++;
    }
    button = document.getElementsByClassName("symbolsemoji");
    addcopy(len, button);
    symbolsset = 1;
}

function flagss() {
    len = flags.length;
    while (fff < len) {
        var btn = document.createElement("BUTTON");
        btn.setAttribute("class", "flagsemoji");
        btn.setAttribute("id", fff);
        var emojitext = document.createTextNode(flags[fff].char);
        btn.appendChild(emojitext);
        document.getElementById("flagsdiv").appendChild(btn);
        fff++;
    }
    button = document.getElementsByClassName("flagsemoji");
    addcopy(len, button);
    flagsset = 1;
}

//copy function
function addcopy(len, button) {
    var nin = 0;
    while (nin < len) {
        let m = nin;
        button[nin].addEventListener("click", function() {
            copy(m, button);
        });
        nin++;
    }
}

function copy(x, button) {
    text.value += button[x].textContent;
    text.select();
    document.execCommand("copy");
}

//yes, this is messy, will be cleaning up in next update
